#Написати програму, яка переміщає всі нулі у кінець списку.
#Ваше завдання — змінити список так, щоб усі нулі опинилися наприкінці списку.
#Порядок ненульових чисел має зберегтися!
#Приклад:
#[0, 1, 0, 12, 3] -> [1, 12, 3, 0, 0]
#[0] -> [0]
#[1, 0, 13, 0, 0, 0, 5] -> [1, 13, 5, 0, 0, 0, 0]
#[9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0] -> [9, 7, 31, 45, 45, 45, 96, 0, 0, 0, 0, 0, 0, 0]


lst = [9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0]
y = lst.count(0)
if y > 0 :
    while y > 0 :
        lst.remove(0)
        lst.append(0)
        y -= 1
print(lst)